# r (read) - откоыть файл для чтения(по умолчанию)
# w (write) - открыть для записи, старое содержимое стирается
# a (append) - открыть для записи в конец

f = open("test_append.txt", "a") # открыли файл на запись
# пускай даже и нет такого файла, но когда мы запустим код
# он автоматически создастся


lines = ["Hello", "my", "friend!\n"]
# метод join это склейка строк
contents = "\n".join(lines) # указываем, что между каждым элементом
# lines у нас будет перенос строки
f.write(contents)

#f.write("Hello\n") # записываем в файл приветствие
#f.write("World\n")

f.close() # не забываем файл закрыть