# r (read) - откоыть файл для чтения(по умолчанию)
# w (write) - открыть для записи, старое содержимое стирается
# a (append) - открыть для записи в конец

f = open("test.txt") # открыли на чтение
# итератор по файлу
for line in f:
    line = line.rstrip()
    print(repr(line))

# После считывания всех трех строк нам уже нечего читать
x = f.read() # в read можно передать сколько символов мы хотим считать
print(repr(x)) # представление x в качестве строки

#x = f.read()# считали все в х
#y = x.splitlines() # разбиение текста на строки(в виде списка)
#print(repr(x)) # распечатали с символами переноса
#print(repr(y))

#rl = f.readline() # считываем исключительно строку
#rl = rl.rstrip() # убираем слева символы переноса строки и пробелы
#print(repr(rl))

f.close() # закрыли файл для чтения